Repository: porokuokka/CaloriesCounter
Catalog: CaloriesCounter/Strings/*/Resources.resw
Source language: en_us
Languages: fi_fi

# 100gInc.Text
source: 100 grams of product includes
fi_fi: 100g tuotetta sisältää

# Add.Content
source: Add
fi_fi: Lisää

# AddingSuccess
source: Adding succeeded!
fi_fi: Lisäys onnistui!

# AddToDiary.Text
source: Add to diary
fi_fi: Lisää päiväkirjaan

# AddToDiaryButton.Content
source: Add to diary
fi_fi: Lisää päiväkirjaan

# ApplicationName.Text
source: Calorie Counter!
fi_fi: Kalorilaskuri!

# Carbohydrates.Text
source: Carbohydrates
fi_fi: Hiilihydraatteja

# Create.Text
source: Create new ingredient
fi_fi: Luo uusi raaka-aine

# CreateNew.Text
source: Create new ingredient
fi_fi: Luo uusi raaka-aine

# CreateNewHelp.Text
source: On create new page you can add a new ingredient. Fill in the boxes and name the ingredient so that you can find it easily with searchcriteria. When the ingredient is added you can find it on search page and add it to your diary.
fi_fi: Luo uusi-sivulla voit luoda uuden ruoka-aineen. Anna ruoka-aineelle nimi, jonka löydät helposti hakusanalla, syötä tekstikenttiin ravinto-arvot, jotka löytyvät helposti finelistä tai paketin kyljestä. Kun ruoka-aine on lisätty, voit hakea sitä hakusivulla ja lisätä ruokapäiväkirjaasi.

# Diary.Text
source: Diary
fi_fi: Päiväkirja

# DiaryHelp.Text
source: In diary you can browse the ingredients and nutritionfacts per day. On search-page you can add ingredients to the selected day. Diary is personal and cannot be viewed but users of the same device.
fi_fi: Päiväkirjassa voi tarkastella sinne päiväkohtaisesti lisäämiäsi ruoka-aineita sekä päivän energiakoostumusta. Valitse päivä kalenterista ja hakemalla ravinto-aineita Hae-sivulta voit lisätä niitä valitulle päivälle. Päiväkirja on henkilökohtainen, ja sitä voi tarkastella vain samaa laitetta käyttävät henkilöt.

# Fat.Text
source: Fat
fi_fi: Rasvaa

# Fibre.Text
source: Fibre
fi_fi: Kuitua

# Home.Text
source: Home
fi_fi: Alkuun

# HttpError
source: Oops! For some reason we are unable to connect to internet. Please check your internet connection and try again!
fi_fi: Hups! Jostain syystä emme saa yhteyttä internetiin. Ole hyvä ja tarkista internet yhteytesi ja koeta uudelleen!

# ItemName.Text
source: Ingredients name
fi_fi: Raaka-aineen nimi

source: Piece
fi_fi: kpl

# Piece.Text
source: Pcs
fi_fi: kpl

# Portion.Text
source: Portion
fi_fi: Annos

# Protein.Text
source: Protein
fi_fi: Proteiinia

# Search.Text
source: Search
fi_fi: Hae

# SearchCriteria.Text
source: Enter your search criteria here
fi_fi: Kirjoita hakusanat tähän

# SearchError.Text
source: Oops! Nothing could be found with submitted search criteria. Please try again with shorter criteria or add a new ingredient
fi_fi: Hups! Hakusanalla ei löydetty tuloksia. Koeta uudelleen esimerkiksi lyhyemmällä hakusanalla tai lisää uusi raaka-aine.

# SearchHelp.Text
source: On search page you can search for ingrediens and add them to the selected day. Ingredients are added to a cloud service so they can be used by other users of the app too.
fi_fi: Hae-sivulla voit hakea ruoka-aineita, tarkastella niiden koostumusta ja lisätä niitä valitulle päivälle ruokapäiväkirjaan. Ruoka-aineet lisätään pilvipalvelussa sijaitsevaan tietokantaan, jotta muutkin voivat käyttää niitä ruokapäiväkirjassaan.

source: Tblsp
fi_fi: rkl

# Tblsp.Text
source: Tblsp
fi_fi: rkl

source: Tsp
fi_fi: tl

# Tsp.Text
source: Tsp
fi_fi: rl

# Weights.Text
source: weights
fi_fi: painaa

# Welcome.Text
source: This app was developed to help keeping a food diary. To stand out from collections of thousands of other similar apps, CalorieCounter! has left out recommendations of losing weight and focused on simple arithmetics of calorie counting. This makes the app applicaple for both needs of losing and gaining weight. CalorieCounter! adds up the calories of a day and saves them into a database where you can easily browse your diary. On diary-page you can also see the nutrition facts of the intake energy per day. CalorieCounter! makes it easy to add new ingredients into a cloud service so you don't have to tie yourself to using an insufficient database.
fi_fi: Tämä sovellus on suunniteltu oman ruokapäiväkirjan pitämisen helpottamiseksi ja erotukseksi tuhansista samanlaisista sovelluksista, Kalorilaskuri! on jättänyt ylimääräiset laihdutus-suositukset ja ohjeistukset pois. Näin laskuri on kätevä myös henkilöille, joiden tavoitteena on saada lisää massaa. Raaka-aineita on helppo lisätä, joten valmiiseen, vajavaiseen tietokantaan ei tarvitse taipua. Kalorilaskuri! laskee kalorisi päivittäin yhteen ja tallentaa ne päiväkirjaan, jota voit tarkastella ja muokata.

# WelcomeHeader.Text
source: Welcome to CalorieCounter!
fi_fi: Tervetuloa käyttämään Kalorilaskuria!

# DayOverview.Text
source: Days intake overview
fi_fi: Päivän energialaskelma

# Delete.Content
source: Delete
fi_fi: Poista

# AddingError
source: Adding was not a success for some reason. Please be patient and try again. Restarting the app might help.
fi_fi: Lisäys ei onnistunut jostain syystä. Ole hyvä ja yritä uudelleen. Sovelluksen avaaminen uudelleen saattaa auttaa.
